tests/stubs/endpoints/invoice/create_invoice.json

{
    "status": true,
    "message": "Payment request created",
    "data": {
        "id": 3136406,
        "domain": "test",
        "amount": 42000,
        "currency": "NGN",
        "due_date": "2020-07-08T00:00:00.000Z",
        "has_invoice": true,
        "invoice_number": 1,
        "description": "a test invoice",
        "line_items": [
            {
                "name": "item 1",
                "amount": 20000
            },
            {
                "name": "item 2",
                "amount": 20000
            }
        ],
        "tax": [
            {
                "name": "VAT",
                "amount": 2000
            }
        ],
        "request_code": "PRQ_1weqqsn2wwzgft8",
        "status": "pending",
        "paid": false,
        "metadata": null,
        "notifications": [],
        "offline_reference": "4286263136406",
        "customer": 25833615,
        "created_at": "2020-06-29T16:07:33.073Z"
    }
}
